const HACKS = [
  {
    "type": "СОР",
    "name": "AvitoTech ML cup 2024",
    "tasks": [
      "[CLF] Задача: предсказать вероятность, что пользователь кликнет рекламу"
    ],
    "prize": "Приз: 600 т.р. (+10 мерч)",
    "participation": "Участие: соло или команда до 4 человек",
    "format": "Формат: онлайн",
    "lang": null,
    "url": "https://ods.ai/competitions/avitotechmlcup2024",
    "registration": null,
    "registration_iso": null,
    "phases": null,
    "start": "2024-11-05",
    "end": "2024-12-05",
    "start_approx": false
  },
  {
    "type": "ХАК",
    "name": "Tender Hack",
    "tasks": [
      "Задача: разработать сервис, осуществляющий мониторинг котировочных сессий на предмет корректности публикации"
    ],
    "prize": "Приз: 500 т.р.",
    "participation": "Участие: команда 3-5 человек",
    "format": "Формат: офлайн в СПБ",
    "lang": null,
    "url": "https://tenderhack.ru/spb",
    "registration": "до 8.11",
    "registration_iso": "2024-11-08",
    "phases": null,
    "start": "2024-11-08",
    "end": "2024-11-10",
    "start_approx": false
  },
  {
    "type": "ХАК",
    "name": "ЦП. Международный хакатон",
    "tasks": [
      "[NLP] Кейс 1: выделение именованных сущностей из электропочты и классификация сообщений",
      "[CV, REC] Кейс 2: поиск смысловых копий изображений",
      "[CV, NLP] Кейс 3: матчинг видеовизитки и описания вакансии",
      "[CV, CLF] Кейс 4: поиск животных на фото и их классификация",
      "[CV] Кейс 5: детекция и распознавание маркировки на изображении",
      "[NLP] Кейс 6: качественный анализ документации на соответствие требованиям",
      "[CLF] Кейс 7: детекция аномалий при строительстве жилых комплексов в части транспортной доступности",
      "[CV] Кейс 8: поиск нарушений автотранспортом на видеозаписи",
      "[CLF] Кейс 9: распознавания фазы глубокого сна и промежуточной фазы сна",
      "[NLP, RAG] Кейс 10: чат-бот для поиска информации в агентской библиотеке материалов"
    ],
    "prize": "Приз: 10 млн. рублей",
    "participation": "Участие: команда 3-5 человек",
    "format": "Формат: гибрид",
    "lang": null,
    "url": "https://hacks-ai.ru/events/1077382",
    "registration": "до 4.11",
    "registration_iso": "2024-11-04",
    "phases": null,
    "start": "2024-11-08",
    "end": "2024-11-10",
    "start_approx": false
  },
  {
    "type": "ХАК",
    "name": "BIV Hack",
    "tasks": [
      "[CLF, NLP] Задача 1: Автоматизация разбора платежей",
      "[NLP] Задача 2: Алгоритм выявления связей между контрагентами"
    ],
    "prize": "Приз: 300 т.р.",
    "participation": "Участие: команда 3-5 человек",
    "format": "Формат: онлайн",
    "lang": null,
    "url": "https://biv-challenge.ru/",
    "registration": "до 12.11",
    "registration_iso": "2024-11-12",
    "phases": null,
    "start": "2024-11-15",
    "end": "2024-11-17",
    "start_approx": false
  },
  {
    "type": "ХАК",
    "name": "TulaHackDays2024",
    "tasks": [
      "[NLP] Трек 1: Контроль показателей здоровья пациентов, киберассистент (помощь) и связь с лечащим врачом",
      "[CV] Трек 2: Мониторинг состояния контейнерных площадок на основе данных, в том числе фото- и видеофиксации"
    ],
    "prize": "Приз: 350 т.р. на каждый трек",
    "participation": "Участие: команда 2-5 человек",
    "format": "Формат: гибрид",
    "lang": null,
    "url": "https://tulahackdays.ru/",
    "registration": "до 12.11",
    "registration_iso": "2024-11-12",
    "phases": null,
    "start": "2024-11-15",
    "end": "2024-11-17",
    "start_approx": false
  },
  {
    "type": "ХАК",
    "name": "AgroCode Hack Genetics",
    "tasks": [
      "[CLF] Задача 1: Система оценки племенной ценности радужной форели",
      "[NLP] Задача 2: «Тиндер» для коров",
      "[REG] Задача 3: Прогнозирование урожайности",
      "[CLT] Задача 4: Историческая агроголоволомка"
    ],
    "prize": "Приз: 200 т.р. на задачу",
    "participation": "Участие: команда 3-5 человек",
    "format": "Формат: онлайн",
    "lang": null,
    "url": "https://rshbdigital.ru/agrocode-hack",
    "registration": "до 14.11",
    "registration_iso": "2024-11-14",
    "phases": null,
    "start": "2024-11-22",
    "end": "2024-11-24",
    "start_approx": false
  },
  {
    "type": "ХАК",
    "name": "T1 | Импульс | Хакатон | Москва",
    "tasks": [
      "[NLP] Трек 1: объединение данных пользователя в золотую запись",
      "[NLP, RAG] Трек 2: цифровой ассистент базы знаний"
    ],
    "prize": "Приз: 600 т.р. на каждый трек",
    "participation": "Участие: команда 3-5 человек",
    "format": "Формат: гибрид (Москва, минимум 2 участника на площадке)",
    "lang": null,
    "url": "https://impulse.t1.ru/hackathons/moscow_2024",
    "registration": "до 25.11",
    "registration_iso": "2024-11-25",
    "phases": null,
    "start": "2024-11-26",
    "end": "2024-11-29",
    "start_approx": false
  },
  {
    "type": "ХАК",
    "name": "ХАКАТОН ЕВРАЗА 3.0",
    "tasks": [
      "[NLP] Задача: автоматический Code Review с помощью ИИ"
    ],
    "prize": "Приз: 500 т.р.",
    "participation": "Участие: команда 2-5 человек",
    "format": "Формат: онлайн",
    "lang": null,
    "url": "https://хакатоневраза.рф/",
    "registration": "до 25.11",
    "registration_iso": "2024-11-25",
    "phases": null,
    "start": "2024-11-29",
    "end": "2024-12-01",
    "start_approx": false
  },
  {
    "type": "ХАК",
    "name": "ФИЦ",
    "tasks": [
      "[NLP] Кейс 2 - БухПульс - Разработать алгоритм сбора обратной связи от пользователей сервисе «Бухэксперт8».",
      "[CV] Кейс 3 - Классификации опор ЛЭП по фото.",
      "[NLP] Кейс 4 - Погонщик нейронок - Как можно быстрее сделать react приложение по макету из Figma, используя любые ИИ помощники.",
      "[NLP] Кейс 5 - Оценка уровня экспертности по резюме.",
      "[NLP] Кейс 6 - Контекстный перевод названий научных работ.",
      "[TS] Кейс 7 - Прогнозирование бизнес драйверов (трафик людей, количество чеков, количество проданных товаров и т.д).",
      "[CV] Кейс 8 - Формирование фото и видео контента с использованием нейросетей на основе биографии и фото персоны.",
      "[CV] Кейс 9 - Разработка алгоритма трекинга людей в видеопотоке с нескольких камер.",
      "[NLP] Кейс 11 - Симуляция записи в расписание.",
      "[CV] Кейс 12 - Сервис для ведения реестра зеленых насаждений города Москвы: подсчета их количества, определения породы и пр. по фото.",
      "[CV] Кейс 14 - Определение доступа на объект с использованием модели распознавания лиц.",
      "[NLP] Кейс 15 - Семантический делитель текстов.",
      "[CLF] Кейс 17 - Стартовый (профилактический) комплаенс: предотвращение рисков с помощью AI.",
      "[NLP] Кейс 20 - Цифровой помощник юриста."
    ],
    "prize": "Приз: 6 000 000 р.",
    "participation": "Участие: команда 2-6 человек",
    "format": "Формат: отборочный этап - онлайн, финал - офлайн (Москва)",
    "lang": null,
    "url": "https://фиц2024.рф/hackathon",
    "registration": "до 26.11",
    "registration_iso": "2024-11-26",
    "phases": null,
    "start": "2024-11-29",
    "end": "2024-12-04",
    "start_approx": false
  },
  {
    "type": "ХАК",
    "name": "Норникель: интеллектуальные горизонты",
    "tasks": [
      "[TS] Трек 1 - Флотомашина времени. Поиск наиболее эффективных диапазонов работы оборудования для повышения объема извлечения руды.",
      "[CV] Трек 2 - Грязные дела. Разработать метод определения степени загрязнения кадра, чтобы обеспечить надежную работу камер на производстве.",
      "[NLP] Трек 3 - Мультимодальные RAG модели. Разработка RAG системы для поиска информации в текстовых документах и картинках."
    ],
    "prize": "Приз: 1 500 000 р.",
    "participation": "Участие: команда 2-5 человек",
    "format": "Формат: онлайн",
    "lang": null,
    "url": "https://nornickel-hackathon.ru/",
    "registration": "до 2.12",
    "registration_iso": "2024-12-02",
    "phases": null,
    "start": "2024-12-06",
    "end": "2024-12-08",
    "start_approx": false
  },
  {
    "type": "ХАК",
    "name": "Совкомбанк SecureHack",
    "tasks": [
      "[NLP] Задача - необходимо создать продукт, который позволит разработчикам, аналитикам информационной безопасности и проектным менеджерам оценивать безопасность своих проектов, сервисов, задач на основе входных данных и предоставлять заключения с практическими рекомендациями по улучшению."
    ],
    "prize": "Приз: 300 000 р.",
    "participation": "Участие: команда 1-3 человек",
    "format": "Формат: онлайн",
    "lang": null,
    "url": "https://codenrock.com/contests/sovkombank-securehack#/",
    "registration": "до 4.12",
    "registration_iso": "2024-12-04",
    "phases": null,
    "start": "2024-12-06",
    "end": "2024-12-15",
    "start_approx": false
  },
  {
    "type": "ХАК",
    "name": "ТерраЛинк Code Fest",
    "tasks": [
      "[NLP] Задача 1. Цифровой ассистент пользователя для исполнения функциональных команд.",
      "[NLP] Задача 2. Нейросеть для проверки соответствия документации стандартам компании с выявлением рисков и отклонений.",
      "[NLP] Задача 3. Нейросеть по распознавание текста (OCR), классификация документов, автоматическое извлечение данных, проверка орфографии, пунктуации, соответствии СТО компании."
    ],
    "prize": "Приз: 600 000 р.",
    "participation": "Участие: команда 2-5 человек",
    "format": "Формат: онлайн",
    "lang": null,
    "url": "https://codenrock.com/contests/terralink-codefest#/",
    "registration": "до 6.12",
    "registration_iso": "2024-12-06",
    "phases": null,
    "start": "2024-12-09",
    "end": "2024-12-15",
    "start_approx": false
  },
  {
    "type": "ХАК",
    "name": "XMAS HACK",
    "tasks": [
      "Кейс 1. Разработать алгоритм, который будет динамически подстраиваться под меняющиеся условия, выбирая оптимальный маршрут для транзакции.",
      "Кейс 3. Прогнозирование уровня риска нового клиента на основе данных о текущих клиентах банка, а также дополнительной информации из открытых источников."
    ],
    "prize": "Приз: 1 000 000 р.",
    "participation": "Участие: команда 2-5 человек",
    "format": "Формат: онлайн",
    "lang": null,
    "url": "https://xmas-hack.ru/",
    "registration": "до 19.12",
    "registration_iso": "2024-12-19",
    "phases": null,
    "start": "2024-12-20",
    "end": "2024-12-23",
    "start_approx": false
  },
  {
    "type": "ХАК",
    "name": "GPT-4o-mini Hackathon",
    "tasks": [
      "Задача: разработать AI-ассистента с использованием модели GPT-4o-mini"
    ],
    "prize": "Призы: 1500$, 1000$ и 500$ (в виде подарков)",
    "participation": "Участие: соло или команда",
    "format": "Формат: онлайн",
    "lang": null,
    "url": "https://www.ogon.ai/blank-6/gpt-4o-mini-hackathon-3",
    "registration": null,
    "registration_iso": null,
    "phases": null,
    "start": "2025-01-20",
    "end": "2025-01-27",
    "start_approx": false
  },
  {
    "type": "СОР",
    "name": "Data Fusion Contest 2025",
    "tasks": [
      "[NLP] Label Craft — необходимо предсказать категорию товаров на основе не полных данных о товаре (названиях и их описаний).",
      "[TS] 4cast — прогнозирование временных рядов для клиентов банка (юридических лиц) на основе их профилей и истории транзакций.",
      "[REG] Distribution — необходимо создать алгоритм, способный предсказывать распределение остатков на счетах клиента на 2 месяца вперед."
    ],
    "prize": "Приз: 3 000 000 р. + мерч",
    "participation": "Участие: соло или командой (до 4 человек)",
    "format": "Формат: онлайн",
    "lang": null,
    "url": "https://ods.ai/tracks/data-fusion-2025-competitions",
    "registration": null,
    "registration_iso": null,
    "phases": null,
    "start": "2025-02-13",
    "end": "2025-04-07",
    "start_approx": false
  },
  {
    "type": "ХАК",
    "name": "Система Хак: Нижний Новгород",
    "tasks": [
      "[STT] Трек 1. Общение без барьеров. Задача – разработать систему генерации автоматических субтитров в реальном времени для интеграции на платформу МТС для видеозвонков, которая сделает онлайн-конференции доступнее для людей с особыми потребностями.",
      "[NLP] Трек 2. Удобный дом. Необходимо придумать и разработать улучшение для приложения, управляющего многоквартирным домом. Новая функция должна сделать сервис комфортнее для всех жильцов: например, автоматически включит домофон для ребенка или вызовет консьержа пожилому человеку."
    ],
    "prize": "Приз: 750 000 р. + мерч всем участникам на площадке",
    "participation": "Участие: команда 2-6 человек",
    "format": "Формат: гибрид , но больше половины участников команды должны быть на площадке (Нижний Новгород)",
    "lang": null,
    "url": "https://truetecharena.ru/contests/system-hack-nn#/",
    "registration": "до 13.02",
    "registration_iso": "2025-02-13",
    "phases": null,
    "start": "2025-02-15",
    "end": "2025-02-16",
    "start_approx": false
  },
  {
    "type": "СОР",
    "name": "Siam ML Hack",
    "tasks": [
      "[REG] Трек 1. Обнаружение бинарных характеристик в данных. Необходимо разработать модель для распознавания ключевых паттернов и их характеристик в дискретных данных, отображаемых на специализированном графике.",
      "[TS] Трек 2. Выделение полезных данных для анализа. Цель — разработать алгоритм, который выявляет самые информативные участки временных рядов и четко определяет их начало и конец, чтобы в дальнейшем проводить более глубокий анализ."
    ],
    "prize": "Приз: 1 000 000 р.",
    "participation": "Участие: команда 1-5 человек",
    "format": "Формат: онлайн",
    "lang": null,
    "url": "https://codenrock.com/contests/siam-hack-ml#/",
    "registration": "до 27.02",
    "registration_iso": "2025-02-27",
    "phases": null,
    "start": "2025-02-28",
    "end": "2025-03-19",
    "start_approx": false
  },
  {
    "type": "ХАК",
    "name": "Kryptonite ML Challenge",
    "tasks": [
      "[CV] Необходимо обучить модель распознавания лиц, которая корректно работает с задачей верификации и определяет фальшивые изображения, созданные с помощью DeepFake-технологий."
    ],
    "prize": "Приз: 600 000 р.",
    "participation": "Участие: соло или командой",
    "format": "Формат: онлайн",
    "lang": null,
    "url": "https://cnrlink.com/kryptonitemltgannounce",
    "registration": "до 1.03",
    "registration_iso": "2025-03-01",
    "phases": null,
    "start": "2025-03-01",
    "end": "2025-03-16",
    "start_approx": false
  },
  {
    "type": "ХАК",
    "name": "Марафон Цифровых Решений",
    "tasks": [
      "[КОМ] Кейс 1 - Оптимизация процесса паллетизации товаров.",
      "[REG] Кейс 2 - прогнозирование и оценка упущенных продаж.",
      "[CV] Кейс 4 - автоматической верификации наличия товара в видео-клипах.",
      "[CLF] Кейс 5 - прогнозирование ситовых характеристик пульпы.",
      "[REG] Кейс 6 - создание предиктивной модели износа техники."
    ],
    "prize": "Приз: индивидуально на кейс (до 1 миллиона).",
    "participation": "Участие: соло или командой",
    "format": "Формат: онлайн",
    "lang": null,
    "url": "https://leader-innovation.ru/mdp",
    "registration": "до 17.03",
    "registration_iso": "2025-03-17",
    "phases": null,
    "start": "2025-03-17",
    "end": "2025-04-14",
    "start_approx": false
  },
  {
    "type": "СОР",
    "name": "Avito ML Cup 2025",
    "tasks": [
      "[REC] Задача 1. Персональные рекомендации: создать модель, которая предскажет интересные для пользователя товары на основе его действий на платформе.",
      "[CV] Задача 2. Поиск дублей: разработать решение для обнаружения одинаковых товаров."
    ],
    "prize": "Приз: 1 200 000 рублей",
    "participation": "Участие: соло или командой (до 4 человек)",
    "format": "Формат: онлайн",
    "lang": null,
    "url": "https://ods.ai/competitions/avitotechmlchallenge2025",
    "registration": null,
    "registration_iso": null,
    "phases": null,
    "start": "2025-03-31",
    "end": "2025-05-28",
    "start_approx": false
  },
  {
    "type": "ХАК",
    "name": "Tender Hack Москва",
    "tasks": [
      "[NLP] Реализация ИИ-ассистента для анализа поисковых запросов пользователей в режиме чата."
    ],
    "prize": "Приз: 500 000 рублей",
    "participation": "Участие: командой (от 3 до 5 человек)",
    "format": "Формат: офлайн (отель «Лесная Сафмар»)",
    "lang": null,
    "url": "https://tenderhack.ru/msk",
    "registration": "до 4.04",
    "registration_iso": "2025-04-04",
    "phases": null,
    "start": "2025-04-04",
    "end": "2025-04-06",
    "start_approx": false
  },
  {
    "type": "ХАК",
    "name": "LLM Coding Challenge",
    "tasks": [
      "[NLP] Сервис структурирования сообщений от агрономов - необходимо разработать решение, которое позволит полностью автоматизировать процесс получения и обработки сообщений (от агрономов) в единую базу данных.",
      "[NLP] Репортер качества кода разработчиков - разработать решение для автоматического ревью кода."
    ],
    "prize": "Приз: 600 000 рублей",
    "participation": "Участие: командой (от 2 до 3 человек)",
    "format": "Формат: онлайн",
    "lang": null,
    "url": "https://llm-challenge.com/",
    "registration": null,
    "registration_iso": null,
    "phases": null,
    "start": "2025-04-10",
    "end": "2025-04-19",
    "start_approx": false
  },
  {
    "type": "СОР",
    "name": "IT_ONE Cup",
    "tasks": [
      "[NLP] Трек 1 - Динамические контекстные подсказки для системного аналитика.",
      "[NLP] Трек 2 - AI-генератор дизайн-макетов по описанию требований.",
      "[NLP] Трек 3 - Система визуализации BPMN-диаграмм."
    ],
    "prize": "Приз: 1 500 000 рублей",
    "participation": "Участие: соло или командой (до 5 человек)",
    "format": "Формат: онлайн",
    "lang": null,
    "url": "https://it-onecup-mlchallenge.ru/",
    "registration": "до 11.04",
    "registration_iso": "2025-04-11",
    "phases": null,
    "start": "2025-04-12",
    "end": "2025-04-29",
    "start_approx": false
  },
  {
    "type": "ХАК",
    "name": "МТС True Tech Hack",
    "tasks": [
      "[CV] TouchVision: AI-ассистент для незрячих и слабовидящих пользователей.",
      "[NLP] MWS GPT: разработай компактную модель «ученик» для эффективной и быстрой классификации текста, которая будет дистиллирована знаниями из тяжелой модели «учителя»."
    ],
    "prize": "Приз: 1 500 000 рублей",
    "participation": "Участие: командой (от 2 до 5 человек)",
    "format": "Формат: онлайн",
    "lang": null,
    "url": "https://truetechhack.ru/",
    "registration": "до 16.04",
    "registration_iso": "2025-04-16",
    "phases": null,
    "start": "2025-04-17",
    "end": "2025-04-22",
    "start_approx": false
  },
  {
    "type": "СОР",
    "name": "Data Fusion Contest 2026",
    "tasks": [
      "[CLF] «Страж» — поиск подозрительных операций в банке: необходимо классифицировать неподтвержденные операции клиентов банка на основе данных историй операций в различных каналах",
      "[CLF] «Киберполка» — подбор финпродуктов: решить задачу multi-label классификации для 41 финансового продукта у клиентов банка на основе обезличенных данных заранее предоставленных признаков",
      "[OPT] «Герои» — построение оптимальных маршрутов: обучающая задача по оптимизации, где участникам необходимо подготовить наилучший план маршрутизации с учетом ограничений на временные окна"
    ],
    "prize": "Приз: 3 000 000 ₽, мерч и другие подарки",
    "participation": "Участие: соло или команда (1-4 человек)",
    "format": "Формат: онлайн",
    "lang": null,
    "url": "https://ods.ai/tracks/data-fusion-2026-competitions",
    "registration": null,
    "registration_iso": null,
    "phases": null,
    "start": "2026-02-09",
    "end": "2026-03-30",
    "start_approx": false
  },
  {
    "type": "СОР",
    "name": "ArenaGo",
    "tasks": [
      "[REG] Соревнование по трейдингу. Вручную или алгоритмами через API."
    ],
    "prize": "Приз: 100 000 ₽",
    "participation": "Участие: соло",
    "format": "Формат: онлайн",
    "lang": null,
    "url": "https://arenago.ru/",
    "registration": null,
    "registration_iso": null,
    "phases": null,
    "start": "2026-02-13",
    "end": "2026-03-26",
    "start_approx": false
  },
  {
    "type": "ХАК",
    "name": "Tender Hack в Перми",
    "tasks": [
      "[NLP] Создайте интеллектуальный сервис обоснования начальной цены закупки"
    ],
    "prize": "Приз: 500 000 ₽",
    "participation": "Участие: команда (3-5 человек)",
    "format": "Формат: очно (отель Holiday Inn Perm)",
    "lang": null,
    "url": "https://tenderhack.ru/perm",
    "registration": null,
    "registration_iso": null,
    "phases": null,
    "start": "2026-03-13",
    "end": "2026-03-15",
    "start_approx": false
  },
  {
    "type": "ХАК",
    "name": "OmniSub2026",
    "tasks": [
      "[CV, NLP] Необходимо разработать алгоритм, который в автоматическом режиме найдёт диктора в кадре, выделит и стабилизирует его губы и распознает речь при любых помехах (повороты головы, плохой свет и другие искажения)."
    ],
    "prize": "Приз: 350 000 ₽",
    "participation": "Участие: соло или команда (до 4 человек)",
    "format": "Формат: онлайн (на Kaggle)",
    "lang": null,
    "url": "https://airi.net/ru/hackathon/omnisub-2026/",
    "registration": "с 10.03",
    "registration_iso": "2026-03-10",
    "phases": null,
    "start": "2026-03-16",
    "end": "2026-03-19",
    "start_approx": false
  },
  {
    "type": "ХАК",
    "name": "IT Purple Huck",
    "tasks": [
      "Кейсы появятся в закрытом чате после регистрации."
    ],
    "prize": "Приз: 1 000 000 ₽",
    "participation": "Участие: команда (2-5 человек)",
    "format": "Формат: онлайн",
    "lang": null,
    "url": "https://it-purple.ru/hack",
    "registration": "до 17.03",
    "registration_iso": "2026-03-17",
    "phases": null,
    "start": "2026-03-26",
    "end": "2026-04-16",
    "start_approx": false
  },
  {
    "type": "ХАК",
    "name": "Tender Hack в Москве!",
    "tasks": [
      "[REC] Разработка персонализированного умного поиска продукции."
    ],
    "prize": "Приз: 500 000 ₽",
    "participation": "Участие: команда (3-5 человек)",
    "format": "Формат: офлайн (отель «Звезды Арбата»)",
    "lang": null,
    "url": "https://tenderhack.ru/msk",
    "registration": "до 4.04",
    "registration_iso": "2026-04-04",
    "phases": null,
    "start": "2026-04-03",
    "end": "2026-04-05",
    "start_approx": false
  },
  {
    "type": "ХАК",
    "name": "МТС True Tech Hack 2026!",
    "tasks": [
      "[NLP, CV, SPC] GPTHub: единое окно для всех ИИ-задач - необходимо создать универсальное веб-приложение на базе OpenWebUI, которое объединяет текст, голос, изображения и работу с файлами в одном чате, автоматически выбирая нужную модель под задачу и используя долгосрочную память.",
      "[NLP] LocalScript: необходимо создать агентскую систему для генерации Lua-кода на базе локальной (легкой) LLM."
    ],
    "prize": "Приз: 1 500 000 ₽",
    "participation": "Участие: команда (2-5 человек)",
    "format": "Формат: онлайн с финалом в Москве",
    "lang": null,
    "url": "https://truetechhack.ru/",
    "registration": "до 9.04",
    "registration_iso": "2026-04-09",
    "phases": null,
    "start": "2026-04-10",
    "end": "2026-04-24",
    "start_approx": false
  },
  {
    "type": "ХАК",
    "name": "Криптонит.Тембр",
    "tasks": [
      "[SPC] Необходимо разработать модель распознавания дикторов по голосу (Speaker Recognition), устойчивую к искажениям аудиосигнала."
    ],
    "prize": "Приз: 600 000 ₽",
    "participation": "Участие: соло или команда (до 5 человек)",
    "format": "Формат: онлайн",
    "lang": null,
    "url": "https://dataton-kryptonite.ru/",
    "registration": "до 10.04",
    "registration_iso": "2026-04-10",
    "phases": null,
    "start": "2026-04-11",
    "end": "2026-04-26",
    "start_approx": false
  },
  {
    "type": "СОР",
    "name": "AvitoTech ML CUP 2026",
    "tasks": [
      "[REC] Предсказать наиболее релевантные объявления для пользователей."
    ],
    "prize": "Приз: 750 000 ₽",
    "participation": "Участие: соло или команда (до 4 человек)",
    "format": "Формат: онлайн",
    "lang": null,
    "url": "https://ods.ai/competitions/avitotechmlcup2026",
    "registration": null,
    "registration_iso": null,
    "phases": null,
    "start": "2026-04-27",
    "end": "2026-05-28",
    "start_approx": false
  },
  {
    "type": "ХАК",
    "name": "Lenta Tech Life Hack",
    "tasks": [
      "[CV] Разработайте систему распознавания ценников в реальных условиях ритейла."
    ],
    "prize": "Приз: 600 000 ₽",
    "participation": "Участие: команда (3-5 человек)",
    "format": "Формат: первый этап — онлайн, финал — офлайн в Москве",
    "lang": null,
    "url": "https://changellenge.com/championships/lenta-tech-life-hack/",
    "registration": "до 8.05",
    "registration_iso": "2026-05-08",
    "phases": null,
    "start": "2026-05-12",
    "end": "2026-05-24",
    "start_approx": false
  },
  {
    "type": "ХАК",
    "name": "MOEX AI HACKATHON",
    "tasks": [
      "[NLP] Разработай ИИ-агента (на основе открытых моделей) для торгов на бирже, который принесет максимальную доходность. Используйте LLM для анализа рынка, новостей и принятия торговых решений в реальном времени."
    ],
    "prize": "Приз: 1 000 000 ₽",
    "participation": "Участие: команда (3-5 человек)",
    "format": "Формат: онлайн",
    "lang": null,
    "url": "https://hack-moex.ru/",
    "registration": "до 10.05",
    "registration_iso": "2026-05-10",
    "phases": null,
    "start": "2026-05-13",
    "end": "2026-06-30",
    "start_approx": false
  },
  {
    "type": "ХАК",
    "name": "Система Хак: Томск 2026",
    "tasks": [
      "[NLP] Разработать ИИ-навигатор для самообразования студентов и школьников."
    ],
    "prize": "Приз: 375 000 ₽",
    "participation": "Участие: команда (2-6 человек)",
    "format": "Формат: комбинированный (половина участников - онлайн, половина - офлайн в Томске)",
    "lang": null,
    "url": "https://truetecharena.ru/contests/system-hack-tomsk-2026#overview",
    "registration": "до 19.05",
    "registration_iso": "2026-05-19",
    "phases": null,
    "start": "2026-05-19",
    "end": "2026-05-22",
    "start_approx": false
  },
  {
    "type": "ХАК",
    "name": "Tender Hack Санкт-Петербург 2026",
    "tasks": [
      "[NLP] Разработать интеллектуальный сервис поиска цен на ключевых маркетплейсах и неформализованных источниках Рунета."
    ],
    "prize": "Приз: 500 000 ₽",
    "participation": "Участие: команда (3-5 человек)",
    "format": "Формат: офлайн (Санкт-Петербург, отель Cosmos)",
    "lang": null,
    "url": "https://tenderhack.ru/spb",
    "registration": "до 22.05",
    "registration_iso": "2026-05-22",
    "phases": null,
    "start": "2026-05-22",
    "end": "2026-05-24",
    "start_approx": false
  },
  {
    "type": "СОР",
    "name": "Финам Арена",
    "tasks": [
      "[NLP] Соревнование алгоритмов и искусственного интеллекта. Цель: заработать больше всех (по доходности стратегии) на виртуальном симуляторе биржи."
    ],
    "prize": "Приз: 300 000 ₽",
    "participation": "Участие: соло",
    "format": "Формат: онлайн",
    "lang": null,
    "url": "https://arena.finam.ru/landing",
    "registration": "до 1.07",
    "registration_iso": "2026-07-01",
    "phases": null,
    "start": "2026-06-01",
    "end": "2026-08-01",
    "start_approx": false
  },
  {
    "type": "ХАК",
    "name": "Норникель AI Science Hack",
    "tasks": [
      "[NLP] Фабрика гипотез: разработать инструмент на базе ИИ, который автоматизирует генерацию и ранжирование научно-исследовательских гипотез для материаловедческих и технологических проектов.",
      "[NLP] Научный клубок: создать knowledge graph или поисково-аналитическую систему, которая связывает статьи, эксперименты, материалы, свойства, режимы, установки, исследовательские команды и выводы.",
      "[CV] Скажи мне, кто твой шлиф: разработать модель машинного обучения для автоматизированного анализа материаловедческих данных — классификации и сегментации микроструктур по SEM/OM-изображениям, интерпретации XRD-профилей, оценки фазовых долей и детекции дефектов."
    ],
    "prize": "Приз: 1 500 000 ₽",
    "participation": "Участие: команда (2-5 человек)",
    "format": "Формат: онлайн",
    "lang": null,
    "url": "https://nornickel-ai-hackathon.ru/",
    "registration": "до 30.06",
    "registration_iso": "2026-06-30",
    "phases": null,
    "start": "2026-07-03",
    "end": "2026-07-05",
    "start_approx": false
  },
  {
    "type": "ХАК",
    "name": "Tutu ИИ-хакатон",
    "tasks": [
      "[NLP] Разработайте проект на основе МСР, помогающий решать реальные задачи путешественников."
    ],
    "prize": "Приз: 150 000 ₽ (для покупок на Туту)",
    "participation": "Участие: соло или командой (до 5 человек)",
    "format": "Формат: онлайн",
    "lang": null,
    "url": "https://hackathon2026.tutu.ru/",
    "registration": "до 14.08",
    "registration_iso": "2026-08-14",
    "phases": null,
    "start": "2026-08-19",
    "end": "2026-08-21",
    "start_approx": false
  },
  {
    "type": "СОР",
    "name": "AI Journey Contest 2026",
    "tasks": [
      "[NLP] Guardian of Truth: научить модель находить контекстные галлюцинации в ответах ИИ-агентов",
      "[NLP] Green Challenge: создать модель физического ИИ для управления антропоморфным роботом Грином",
      "[NLP] Coordination Referee: построить модель арбитра для распознавания и определения типов сбоев во взаимодействии ИИ-агентов",
      "[CV] 3D DIT Distillation: ускорить генерацию 3D-объектов на базе Kandinsky 3D",
      "[CV] Vision-Action Data Factory: собрать фабрику датасетов для обучения робототехнических моделей"
    ],
    "prize": "Приз: > 10 000 000 ₽",
    "participation": "Участие: соло или командой (до 4 человек)",
    "format": "Формат: онлайн",
    "lang": null,
    "url": "https://dsworks.ru/group/aij2026",
    "registration": null,
    "registration_iso": null,
    "phases": null,
    "start": "2026-08-25",
    "end": "2026-10-20",
    "start_approx": false
  },
  {
    "type": "ХАК",
    "name": "Hack.Genesis 2026",
    "tasks": [
      "[NLP] Кейс 1. Умный роутинг выплат: разработайте систему, которая выбирает подходящего платежного провайдера для каждой выплаты с учетом стратегий, ограничений, загрузки и вероятности успеха.",
      "[NLP] Кейс 2. Генератор интеграций с платежными провайдерами: разработайте инструмент, который по OpenAPI-спецификации платежного провайдера автоматически создает заготовку интеграции, документацию и тестовые примеры."
    ],
    "prize": "Приз: 700 000 ₽",
    "participation": "Участие: соло",
    "format": "Формат: соло или командой (до 3 человек)",
    "lang": "Язык разработки обеих задач: Ruby",
    "url": "https://hackgenesis2026.ru/",
    "registration": "до 31.08",
    "registration_iso": "2026-08-31",
    "phases": null,
    "start": "2026-09-03",
    "end": "2026-09-08",
    "start_approx": false
  },
  {
    "type": "СОР",
    "name": "Alfa Connectome",
    "tasks": [
      "[ML] Задача: прогнозирование будущих движений цен для одного из инструментов на основе реальных рыночных данных."
    ],
    "prize": "Приз: 13 600 $",
    "participation": "Участие: соло или командой",
    "format": "Формат: онлайн",
    "lang": null,
    "url": "https://wundernn.io/connectome",
    "registration": null,
    "registration_iso": null,
    "phases": null,
    "start": "2026-09-11",
    "end": "2026-11-15",
    "start_approx": false
  },
  {
    "type": "ХАК",
    "name": "Лидеры цифровой трансформации 2026",
    "tasks": [
      "[NLP/CV/ML] 20 различных заданий"
    ],
    "prize": "Приз: 40 000 000 ₽",
    "participation": "Участие: команда (от 2 до 5 человек)",
    "format": "Формат: онлайн",
    "lang": null,
    "url": "https://i.moscow/lct",
    "registration": "до 14.09",
    "registration_iso": "2026-09-14",
    "phases": null,
    "start": "2026-09-15",
    "end": "2026-10-30",
    "start_approx": false
  },
  {
    "type": "ХАК",
    "name": "О! Хакатон",
    "tasks": [
      "[NLP] «О!дин запрос» — создать AI-агента для путешествий и отелей.",
      "[NLP] «О!дин шаг до идеального отеля» — «переизобрести» опыт бронирования пользователя с помощью AI и новых интерфейсных механик."
    ],
    "prize": "Приз: 1 000 000 ₽",
    "participation": "Участие: соло или командой (до 5 человек)",
    "format": "Формат: онлайн",
    "lang": null,
    "url": "https://ostrovok.tech/hackathon/",
    "registration": "до 16.09",
    "registration_iso": "2026-09-16",
    "phases": null,
    "start": "2026-09-23",
    "end": "2026-09-30",
    "start_approx": false
  },
  {
    "type": "ХАК",
    "name": "Хакатон Московского транспорта",
    "tasks": [
      "[NLP] Резервная одометрия по модели (вычисление скорости и положения трамвая)",
      "[NLP] ИИ-прогноз загрузки (прогнозирования пассажиропотока) трамвайных маршрутов",
      "[NLP] Разработай систему для прогнозирования изменений в графике движения городского транспорта.",
      "[NLP] Разработай интерактивную обучающую игру для сотрудников высокоскоростной магистрали"
    ],
    "prize": "Приз: 4 000 000 ₽",
    "participation": "Участие: команда (от 3 до 5 человек)",
    "format": "Формат: онлайн (финал в Москве)",
    "lang": null,
    "url": "https://mt-hackathon.ru/",
    "registration": "до 25.09",
    "registration_iso": "2026-09-25",
    "phases": null,
    "start": "2026-09-25",
    "end": "2026-10-03",
    "start_approx": false
  },
  {
    "type": "ХАК",
    "name": "ИИ-ассистенты для энергетики",
    "tasks": [
      "[NLP] 1ИИ-помощник для подготовки презентаций",
      "[NLP] Помощник для анализа документов из судов",
      "[NLP] Ассистент для создания ИТ/ИБ-дайджестов",
      "[NLP] Архитектор BPMN-диаграмм"
    ],
    "prize": "Приз: 750 000 ₽",
    "participation": "Участие: соло или команда (до 5 человек)",
    "format": "Формат: онлайн (финал в Москве)",
    "lang": null,
    "url": "https://codenrock.com/contests/ii-assistenty",
    "registration": "до 27.09",
    "registration_iso": "2026-09-27",
    "phases": null,
    "start": "2026-09-28",
    "end": "2026-11-03",
    "start_approx": false
  },
  {
    "type": "ХАК",
    "name": "Уолл-стрит код",
    "tasks": [
      "[NLP] Создайте свою лучшую стратегию на рынке США с помощью алгоритмической или ручной торговли на демо-капитале."
    ],
    "prize": "Приз: 600 000 ₽",
    "participation": "Участие: соло или командой (до 5 человек)",
    "format": "Формат: онлайн",
    "lang": null,
    "url": "https://collab.finam.ru/wsc/",
    "registration": null,
    "registration_iso": null,
    "phases": null,
    "start": "2026-09-28",
    "end": "2026-11-23",
    "start_approx": false
  },
  {
    "type": "ХАК",
    "name": "Академия Финтеха 2026",
    "tasks": [
      "[NLP] Финтех без границ: банк будущего для бизнеса и клиентов. Решай реальные задачи пользователей и создавай сервисы и инструменты для клиентов, бизнеса и сотрудников банка (Трек ВТБ)",
      "[NLP] Эффективность 360: технологии для внутренних процессов. Создавай решения для оптимизации бизнес-процессов и развития сотрудников (Трек Финансового университета)"
    ],
    "prize": "Приз: 1 500 000 ₽",
    "participation": "Участие: команда (от 2 до 5 человек)",
    "format": "Формат: онлайн + офлайн-финал в Москве",
    "lang": null,
    "url": "https://fintechacademy.ru/",
    "registration": "до 11.10",
    "registration_iso": "2026-10-11",
    "phases": null,
    "start": "2026-10-05",
    "end": "2026-12-11",
    "start_approx": false
  },
  {
    "type": "ХАК",
    "name": "Продуктовый Хакатон «Точка сборки»",
    "tasks": [
      "[NLP] GigaCowork — ИИ-помощник для создания образовательных программ",
      "[NLP] DBI — голосовой помощник для записи в клинику",
      "[NLP] М.Видео — ИИ-решение для автоматического заполнения характеристик товаров"
    ],
    "prize": "Приз: 1 500 000 ₽",
    "participation": "Участие: команда (от 2 до 4 человек)",
    "format": "Формат: онлайн, офлайн-финал в Магасе",
    "lang": "Для разработки Cloud.ru предоставляет доступ к вычислительным ресурсам",
    "url": "https://producthack.ru/",
    "registration": "до 11.10",
    "registration_iso": "2026-10-11",
    "phases": null,
    "start": "2026-10-13",
    "end": "2026-11-30",
    "start_approx": false
  },
  {
    "type": "СОР",
    "name": "Yandex Cup 2026",
    "tasks": [
      "[ML] Предсказание музыкального жанра по звучанию трека (Яндекс Музыка)",
      "[ML] Краткосрочное предсказание интенсивности осадков (Яндекс Погода)",
      "[ML] Распознавание слов по нарисованным кривым на экране смартфона (Яндекс Клавиатура)"
    ],
    "prize": "Приз: 1 500 000 ₽",
    "participation": "Участие: соло",
    "format": "Формат: квалификация — онлайн, офлайн-финал в Москве",
    "lang": null,
    "url": "https://yandex.ru/cup/ml",
    "registration": null,
    "registration_iso": null,
    "phases": [
      {
        "label": "квалификация",
        "start": "2026-10-23",
        "end": "2026-11-01",
        "start_approx": false
      },
      {
        "label": "финал",
        "start": "2026-11-27",
        "end": "2026-11-29",
        "start_approx": false
      }
    ],
    "start": "2026-10-23",
    "end": "2026-11-29",
    "start_approx": false
  }
];
